#+TITLE: Thesis Structure
#+AUTHOR: Tigany Zarrouk

*** READ Nematollahi - Understand the specifics of carbon-drag analysis. [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo
    :END:
    :LOGBOOK:
    CLOCK: [2021-04-10 Sat 16:50]--[2021-04-10 Sat 16:54] =>  0:04
    CLOCK: [2021-04-10 Sat 16:29]--[2021-04-10 Sat 16:49] =>  0:20
    CLOCK: [2021-04-10 Sat 15:57]--[2021-04-10 Sat 16:05] =>  0:08
    CLOCK: [2021-04-10 Sat 15:52]--[2021-04-10 Sat 15:56] =>  0:04
    :END:

**** ROAM Writing: Differences in assumptions for the velocity dependence

     :LOGBOOK:
     CLOCK: [2021-07-13 Tue 11:52]--[2021-07-13 Tue 12:17] =>  0:25
     CLOCK: [2021-07-13 Tue 10:55]--[2021-07-13 Tue 11:20] =>  0:25
     CLOCK: [2021-07-13 Tue 10:23]--[2021-07-13 Tue 10:48] =>  0:25
     CLOCK: [2021-07-13 Tue 09:50]--[2021-07-13 Tue 10:15] =>  0:25
     CLOCK: [2021-07-13 Tue 09:19]--[2021-07-13 Tue 09:45] =>  0:26
     CLOCK: [2021-07-12 Mon 11:30]--[2021-07-12 Mon 11:55] =>  0:25
     CLOCK: [2021-07-12 Mon 10:34]--[2021-07-12 Mon 10:59] =>  0:25
     CLOCK: [2021-07-12 Mon 09:46]--[2021-07-12 Mon 10:11] =>  0:25
     CLOCK: [2021-07-12 Mon 09:16]--[2021-07-12 Mon 09:41] =>  0:25
     CLOCK: [2021-05-25 Tue 11:27]--[2021-05-25 Tue 11:52] =>  0:25
     CLOCK: [2021-05-24 Mon 11:53]--[2021-05-24 Mon 12:18] =>  0:25
     CLOCK: [2021-04-10 Sat 18:30]--[2021-04-10 Sat 18:55] =>  0:25
     CLOCK: [2021-04-10 Sat 16:59]--[2021-04-10 Sat 17:24] =>  0:25
     :END:
     - In Nematollahi, the change in occupancies is dependent on the
       activation of the energy barrier between sites.
     - This energy barrier is the migration energy barrier

       \begin{align*}
         \frac{\partial \chi_i}{\partial t} = \sum_{j=1}^4 \left\{
       &\chi_j (1 - \chi_i) \nu_0^{\text{migration}} \exp{\left[ -
       E_{\text{barrier}}^{i\rightarrow j} / k_{\text{B}} T\right]}\\ -
              &\chi_i (1 - \chi_j) \nu_0^{\text{migration}} \exp{\left[ -
       E_{\text{barrier}}^{j\rightarrow i} / k_{\text{B}} T\right]}
       \right\} + \frac{\bar{v}_{\text{disl}}}{a/2} [x_{j+} - x_{i}]
       \end{align*}

     - Last term is a convection term which can be added to account for
       a moving dislocation (going to the right)
     - Where a $j+$ site is to the right of the $i^{\text{th}}$ site,
       and an $j-$ occupied to the left.
     - With dislocation movement the occupations /move backwards/ from
       the $j+$ to $i^{\text{th}}$ and from $i^{\text{th}}$ to $j-$
       sites.
     - Summation over 4 as 4 "first-neighbour" octahedral sites.


     - In Ivo's paper, the change in occupancy has a time dependence,
       which is due to the velocity of a dislocation.
     - This mediated between the two limiting regimes of static and
       equilbrium occupancies upon dislocation motion.

       \[ \frac{\partial \chi_i}{\partial t} = \bar{v}\frac{\partial
       \chi_i}{\partial x} = \left( \chi_i^e(x) - \chi_i(x,\bar{v})
       \right) \nu_0^{\text{solute escape}} \exp{ - E_i(r) / k_{\text{B}} T} \]

     - Here the attempt frequencies are different as one is for a
       hydrogen to escape from the binding of the dislocation to the
       bulk, and the other is to escape the relative energy barrier
       between sites.

     - If it is possible to assume that one can superimpose the
       occupancy effects of carbon _diffusion_, then we can have an
       equation for the velocity dependence.

*** ROAM High-mobility zone around hard core has not been investigated: Flesh out idea of this
    :LOGBOOK:
    CLOCK: [2021-04-10 Sat 15:56]--[2021-04-10 Sat 15:57] =>  0:01
    :END:
  [2021-04-10 Sat 15:56]
  [[file:~/Documents/docs/Management/roam/nematollahi2016a.org::*Asymmetry
  of carbon migration barriers due to strain field][Asymmetry of
  carbon migration barriers due to strain field]]
  - Velocity defined by orowan's equation in Nematollahi [[file:roam/nematollahi2016a.org][Nematollahi2016a: Multiscale description of carbon-supersaturated ferrite in severely drawn pearlitic wires]]
  - We can use the self-consistent description of velocity in our
    calculations such that we know what the velocity is from the line
    tension model.
  - Compare with dislocation velocity range found in the paper of
    80-1000 Å/s.
  - Intermediate positions of the high mobility zone correspond to
    hard core config.
  - What is actually posssible is discrete diffusion within the line
    tension model! We just need to measure the energy barriers

*** TODO Titanium work [1/9]
    :PROPERTIES:
    :COOKIE_DATA: todo
    :END:
    :LOGBOOK:
    CLOCK: [2021-08-26 Thu 14:24]--[2021-08-26 Thu 14:31] =>  0:07
    CLOCK: [2021-08-25 Wed 09:18]--[2021-08-25 Wed 09:43] =>  0:25
    CLOCK: [2021-08-24 Tue 15:54]--[2021-08-24 Tue 15:55] =>  0:01
    CLOCK: [2021-08-23 Mon 12:28]--[2021-08-23 Mon 12:53] =>  0:25
    CLOCK: [2021-07-22 Thu 13:27]--[2021-07-22 Thu 13:52] =>  0:25
    CLOCK: [2021-04-12 Mon 12:38]--[2021-04-12 Mon 13:03] =>  0:25
    CLOCK: [2021-04-12 Mon 12:00]--[2021-04-12 Mon 12:25] =>  0:25
    :END:

    <2021-08-06 Fri>--<2021-09-10 Fri>

**** WAITING Embedding Calculations                                 :WAITING:
     SCHEDULED: <2021-09-02 Thu 13:00>
     - State "WAITING"    from "WAITING"    [2021-08-26 Thu 09:13] \\
       The juc cluster seems fine now. Still running after 16 hours. Check in
       6 hours
     - State "WAITING"    from "WAITING"    [2021-08-25 Wed 13:21] \\
       Had core dump from last run. Retrying without changing anything as
       using
       gdb <path-to-binary> <core-file>
       with any of the core files does not work
     - State "WAITING"    from "WAITING"    [2021-08-23 Mon 11:15] \\
       Submitted third calculation
     - State "WAITING"    from "WAITING"    [2021-08-11 Wed 12:04] \\
       Waiting for calculation on juc with smaller cell to finish
     - State "WAITING"    from "TODO"       [2021-06-04 Fri 11:18] \\
       Waiting for the budget of Young to get back to normal
     :LOGBOOK:
     CLOCK: [2021-09-01 Wed 11:06]--[2021-09-01 Wed 11:12] =>  0:06
     CLOCK: [2021-08-31 Tue 10:34]--[2021-08-31 Tue 10:34] =>  0:00
     CLOCK: [2021-08-31 Tue 10:30]--[2021-08-31 Tue 10:33] =>  0:03
     CLOCK: [2021-08-26 Thu 09:16]--[2021-08-26 Thu 09:16] =>  0:00
     CLOCK: [2021-08-26 Thu 09:16]--[2021-08-26 Thu 09:16] =>  0:00
     CLOCK: [2021-08-26 Thu 09:12]--[2021-08-26 Thu 09:15] =>  0:03
     CLOCK: [2021-08-25 Wed 13:07]--[2021-08-25 Wed 13:22] =>  0:15
     CLOCK: [2021-08-24 Tue 15:19]--[2021-08-24 Tue 15:21] =>  0:02
     CLOCK: [2021-08-23 Mon 11:13]--[2021-08-23 Mon 11:22] =>  0:09
     CLOCK: [2021-06-02 Wed 11:05]--[2021-06-02 Wed 11:31] =>  0:26
     CLOCK: [2021-05-26 Wed 16:09]--[2021-05-26 Wed 16:34] =>  0:25
     CLOCK: [2021-05-26 Wed 15:31]--[2021-05-26 Wed 15:56] =>  0:25
     CLOCK: [2021-05-25 Tue 14:55]--[2021-05-25 Tue 15:20] =>  0:25
     :END:

***** DONE Figure out why forces are reducing, but energy is not
      :LOGBOOK:
      CLOCK: [2021-06-21 Mon 10:51]--[2021-06-21 Mon 10:51] =>  0:00
      :END:
    [2021-06-21 Mon 10:51]
    [[file:~/Documents/docs/Management/org/TODOs.org::*Hydrogen-titanium fitting][Hydrogen-titanium fitting]]

    - Seems to be due to the fact that the embedding was getting the
      structure a little wrong: it was all of the atoms made by the
      bop code with rprune---addition of atoms due to the length of
      the recursion chain.
**** TODO Review s-d tight-binding models [1/1]
     SCHEDULED: <2021-08-09 Mon 13:00>
     :PROPERTIES:
     :COOKIE_DATA: todo
     :END:
     :LOGBOOK:
     CLOCK: [2021-08-10 Tue 13:40]--[2021-08-10 Tue 14:05] =>  0:25
     CLOCK: [2021-08-10 Tue 13:09]--[2021-08-10 Tue 13:34] =>  0:25
     CLOCK: [2021-08-09 Mon 12:37]--[2021-08-09 Mon 13:02] =>  0:25
     CLOCK: [2021-07-12 Mon 16:05]--[2021-07-12 Mon 16:30] =>  0:25
     CLOCK: [2021-07-12 Mon 15:31]--[2021-07-12 Mon 15:56] =>  0:25
     CLOCK: [2021-07-12 Mon 14:45]--[2021-07-12 Mon 15:10] =>  0:25
     CLOCK: [2021-07-12 Mon 14:14]--[2021-07-12 Mon 14:39] =>  0:25
     CLOCK: [2021-03-03 Wed 14:33]--[2021-03-03 Wed 14:58] =>  0:25
     CLOCK: [2021-03-01 Mon 11:08]--[2021-03-01 Mon 11:33] =>  0:25
     CLOCK: [2021-03-01 Mon 10:37]--[2021-03-01 Mon 11:02] =>  0:25
     CLOCK: [2021-02-26 Fri 11:52]--[2021-02-26 Fri 12:17] =>  0:25
     CLOCK: [2021-02-24 Wed 16:49]--[2021-02-24 Wed 17:14] =>  0:25
     CLOCK: [2021-02-24 Wed 16:44]--[2021-02-24 Wed 16:49] =>  0:05
     CLOCK: [2021-02-24 Wed 16:44]--[2021-02-24 Wed 16:44] =>  0:00
     :END:
     [2021-02-24 Wed 16:44]

**** WAITING BCC oxygen solution energies DFT comparison            :WAITING:
     SCHEDULED: <2021-09-06 Mon 12:00>
     :LOGBOOK:
     CLOCK: [2021-08-31 Tue 10:25]--[2021-08-31 Tue 10:30] =>  0:05
     :END:
     - State "WAITING"    from "TODO"       [2021-08-23 Mon 12:39] \\
       One must wait for the TiO2 fitting to finish
     - These calculations are on gherkin
     - We can use the new binaries which dimitar has made.

**** DONE Check the BCC phonon sd Ti bandstructure
     :LOGBOOK:
     CLOCK: [2021-07-15 Thu 12:30]--[2021-07-15 Thu 12:30] =>  0:00
     :END:
   [2021-07-15 Thu 12:30]
   [[file:~/Documents/docs/Management/roam/paxton2010.org::*Notes][Notes]]
***** DONE [#A] Implement Partial occupancy line tension model
      DEADLINE: <2021-01-28 Thu> SCHEDULED: <2021-01-28 Thu 09:30>
      :PROPERTIES:
      :ORDERED:  t
      :END:
      :LOGBOOK:
      CLOCK: [2021-01-28 Thu 17:03]--[2021-01-28 Thu 17:28] =>  0:25
      CLOCK: [2021-01-28 Thu 16:37]--[2021-01-28 Thu 17:02] =>  0:25
      CLOCK: [2021-01-28 Thu 15:49]--[2021-01-28 Thu 16:14] =>  0:25
      CLOCK: [2021-01-28 Thu 14:11]--[2021-01-28 Thu 14:36] =>  0:25
      CLOCK: [2021-01-28 Thu 11:39]--[2021-01-28 Thu 12:04] =>  0:25
      CLOCK: [2021-01-28 Thu 10:59]--[2021-01-28 Thu 11:24] =>  0:25
      CLOCK: [2021-01-28 Thu 10:11]--[2021-01-28 Thu 10:36] =>  0:25
      CLOCK: [2021-01-27 Wed 17:01]--[2021-01-27 Wed 17:26] =>  0:25
      CLOCK: [2021-01-27 Wed 16:18]--[2021-01-27 Wed 16:43] =>  0:25
      CLOCK: [2021-01-27 Wed 15:33]--[2021-01-27 Wed 15:48] =>  0:15
      CLOCK: [2021-01-27 Wed 15:23]--[2021-01-27 Wed 15:32] =>  0:09
      CLOCK: [2021-01-27 Wed 11:29]--[2021-01-27 Wed 11:54] =>  0:25
      CLOCK: [2021-01-27 Wed 10:57]--[2021-01-27 Wed 11:22] =>  0:25
      CLOCK: [2021-01-27 Wed 10:19]--[2021-01-27 Wed 10:44] =>  0:25
      CLOCK: [2021-01-27 Wed 09:46]--[2021-01-27 Wed 10:11] =>  0:25
      CLOCK: [2021-01-26 Tue 13:21]--[2021-01-26 Tue 13:44] =>  0:23
      CLOCK: [2021-01-26 Tue 13:20]--[2021-01-26 Tue 13:21] =>  0:01
      CLOCK: [2021-01-26 Tue 13:19]--[2021-01-26 Tue 13:20] =>  0:01
      CLOCK: [2021-01-26 Tue 11:32]--[2021-01-26 Tue 11:57] =>  0:25
      CLOCK: [2021-01-26 Tue 11:02]--[2021-01-26 Tue 11:27] =>  0:25
      CLOCK: [2021-01-26 Tue 10:16]--[2021-01-26 Tue 10:41] =>  0:25
      CLOCK: [2021-01-26 Tue 09:39]--[2021-01-26 Tue 10:00] =>  0:21
      CLOCK: [2021-01-26 Tue 09:39]--[2021-01-26 Tue 09:39] =>  0:00
      CLOCK: [2021-01-26 Tue 09:38]--[2021-01-26 Tue 09:38] =>  0:00
      CLOCK: [2021-01-26 Tue 09:36]--[2021-01-26 Tue 09:36] =>  0:00
      CLOCK: [2021-01-26 Tue 09:35]--[2021-01-26 Tue 09:36] =>  0:01
      CLOCK: [2021-01-11 Mon 16:51]--[2021-01-11 Mon 17:16] =>  0:25
      CLOCK: [2021-01-11 Mon 16:21]--[2021-01-11 Mon 16:46] =>  0:25
      CLOCK: [2021-01-11 Mon 14:36]--[2021-01-11 Mon 14:55] =>  0:19
      CLOCK: [2021-01-11 Mon 14:30]--[2021-01-11 Mon 14:35] =>  0:05
      CLOCK: [2021-01-11 Mon 14:30]--[2021-01-11 Mon 14:30] =>  0:00
      CLOCK: [2021-01-11 Mon 10:46]--[2021-01-11 Mon 10:55] =>  0:09
      CLOCK: [2021-01-11 Mon 10:30]--[2021-01-11 Mon 10:45] =>  0:15
      :END:

*** DONE Plot d/sd peierls potential - How does non-O/sd change?
    DEADLINE: <2020-09-04 Fri>
    :PROPERTIES:
    :ORDERED:  t
    :END:
    - State "DONE"       from "WAITING"    [2020-09-04 Fri 14:01]
    - State "WAITING"    from "TODO"       [2020-09-02 Wed 10:18] \\
      Waiting for the simulations to finish
    :LOGBOOK:
    CLOCK: [2020-09-04 Fri 12:00]--[2020-09-04 Fri 14:01] =>  2:01
    CLOCK: [2020-09-01 Tue 15:37]--[2020-09-01 Tue 21:10] =>  5:33
    :END:

    - Not much difference between the canonical-d band model and the sd
      model. The difference is surely within the error of convergence for these
      calculations.  

*** WAITING Defect cluster calculations are ongoing                 :WAITING:
    SCHEDULED: <2021-09-06 Mon 12:00>
    :LOGBOOK:
    CLOCK: [2021-08-24 Tue 15:33]--[2021-08-24 Tue 15:44] =>  0:11
    :END:
    - State "WAITING"    from "TODO"       [2021-08-13 Fri 16:29] \\
      Defect cluster relaxations for Fe-C waiting on onyx

    - <2021-08-23 Mon>
      - Currently relaxing
        RESUME_0_site_final_output_single_C_3__6_6_6__fe_bcc on onyx.

    - <2021-08-24 Tue>
      - Still relaxing C_3 666 site.
      - Check if relaxation is sufficient and what the positions are
        like.
*** TODO Forst analysis
    :LOGBOOK:
    CLOCK: [2021-08-31 Tue 15:43]--[2021-08-31 Tue 15:47] =>  0:04
    :END:
    - Write this up in one of the chapters perhaps.
*** WAITING Prepare 5 image diffusion neb calculations              :WAITING:
    - State "WAITING"    from "TODO"       [2021-06-04 Fri 11:18] \\
      Waiting for the diffusion barriers to converge.
      - It seems that using the spring term of 0.5 is quite large,
	perhaps it makes sense to change it to something smaller.
    :LOGBOOK:
    CLOCK: [2021-05-25 Tue 10:38]--[2021-05-25 Tue 11:03] =>  0:25
    CLOCK: [2021-05-24 Mon 11:05]--[2021-05-24 Mon 11:30] =>  0:25
    CLOCK: [2021-05-24 Mon 09:56]--[2021-05-24 Mon 09:57] =>  0:01
    :END:
    [2021-05-24 Mon 09:56]
    - Calculations are going well for
      - E9-E9
      - H3-H4


       Some spring constants are too
      low. Should be around 0.5.

*** DONE Derive line tension equations
    DEADLINE: <2020-09-25 Fri>
    :LOGBOOK:
    CLOCK: [2020-09-15 Tue 11:00]--[2020-09-16 Wed 11:39] => 24:39
    CLOCK: [2020-09-08 Tue 10:25]--[2020-09-08 Tue 11:52] =>  1:27
    :END:

